Revit 2026 API

# MultiServerServiceSetActiveServers(IListGuid, Document) Method

---
**Namespace:** Autodesk.Revit.DB.ExternalService**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public void SetActiveServers(
	IList<Guid> serverIds,
	Document document
)
```
```vb
Public Sub SetActiveServers (
	serverIds As IList(Of Guid),
	document As Document
)
```
```cpp
public:
void SetActiveServers(
	IList<Guid>^ serverIds,
	Document^ document
)
```
```fsharp
member SetActiveServers :
        serverIds : IList<Guid> *
        document : Document -> unit
```

#### Parameters

serverIds IListGuid

document Document

#### Reference

MultiServerService Class

SetActiveServers Overload

Autodesk.Revit.DB.ExternalService Namespace